_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаБазыРаспределенияНакладныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УстановкаБазыРаспределенияНакладныхРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_БазаРаспределенияПоНаправлениюДеятельности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УПН_ПлощадиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УПН_ПлощадиОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЖилыхКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыНаправленияДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыНаправленияДеятельности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/АУН_КатегорииОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>АУН_КатегорииОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комната</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаБазыРаспределенияНакладныхРасходов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;  
		
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	 // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 	
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
	
		
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//// Подсистема "Свойства"
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
	//	ОбновитьЭлементыДополнительныхРеквизитов();
	//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	//// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//// Обработчик подсистемы "Свойства"
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_УСОERP_УстановкаБазыРаспределенияНакладныхРасходов", ПараметрыЗаписи, Объект.Ссылка);
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаправлениеДеятельностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Форма = ПолучитьФорму("Справочник.НаправленияДеятельности.Форма.ФормаВыбора",, Элемент);
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Форма.Список.Отбор.Элементы, , ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДополнительныеРеквизиты.Значение", Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДополнительныеРеквизиты.Свойство", ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УСОERP_РаспределяемыеЗатраты"), ВидСравненияКомпоновкиДанных.Равно,,Истина);

	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список,"ДополнительныеРеквизиты.Свойство",Истина,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБазаРаспределения

&НаКлиенте
Процедура БазаРаспределенияНаправлениеДеятельностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка =  Ложь;
	СписокНаправлений = ПолучитьСписокДоступныхНаправлений();
	ФормаВыбора = ПолучитьФорму("Справочник.НаправленияДеятельности.Форма.ФормаВыбора", , Элемент);
	//ОбщегоНазначенияКлиентСЕрвер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "ДополнительныеРеквизиты.Свойство", ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УСОERP_РаспределяемыеЗатраты"), ВидСравненияКомпоновкиДанных.Равно,,Истина);
	//ОбщегоНазначенияКлиентСЕрвер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "ДополнительныеРеквизиты.Значение", Ложь, ВидСравненияКомпоновкиДанных.НеРавно,,Истина);
	ОбщегоНазначенияКлиентСЕрвер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список, "Ссылка",СписокНаправлений, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	ФормаВыбора.открыть();
	//
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхНаправлений()
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаправленияДеятельностиДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	Справочник.НаправленияДеятельности.ДополнительныеРеквизиты КАК НаправленияДеятельностиДополнительныеРеквизиты
	|ГДЕ
	|	НаправленияДеятельностиДополнительныеРеквизиты.Значение = ИСТИНА
	|	И НаправленияДеятельностиДополнительныеРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УСОERP_РаспределяемыеЗатраты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаправленияДеятельности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|ГДЕ
	|	НЕ НаправленияДеятельности.Ссылка В
	|				(ВЫБРАТЬ
	|					ВрТаб.Ссылка
	|				ИЗ
	|					ВрТаб)
	|	И НаправленияДеятельности.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНаправленияДеятельности.Используется)";
	
	СписокВозврата = Новый СписокЗначений;
	СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокВозврата;
	
КонецФункции

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.БазаРаспределения.Количество() > 0 Тогда
		Ответ = Неопределено;		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамЗавершение", ЭтотОбъект), НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);			
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Объект.БазаРаспределения.Очистить();
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.ОбъектыЭксплуатации) КАК ОбъектЭксплуатации,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиПоОбъектам
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В ИЕРАРХИИ (&СчетУчета), &ВидСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.СуммаОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АУН_ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
		|	ВТ_ОстаткиПоОбъектам.ОбъектЭксплуатации.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбщаяПлощадь КАК ПараметрРаспределения,
		|	ВТ_ОстаткиПоОбъектам.ОбъектЭксплуатации
		|ПОМЕСТИТЬ ВТ_ОбъектыНедвижимости
		|ИЗ
		|	ВТ_ОстаткиПоОбъектам КАК ВТ_ОстаткиПоОбъектам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АУН_ОбъектыНедвижимости КАК АУН_ОбъектыНедвижимости
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&КонецПериода, ) КАК УПН_ПлощадиОбъектовНедвижимостиСрезПоследних
		|			ПО АУН_ОбъектыНедвижимости.Ссылка = УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|		ПО ВТ_ОстаткиПоОбъектам.ОбъектЭксплуатации = АУН_ОбъектыНедвижимости.ОбъектЭксплуатации
		|ГДЕ
		|	АУН_ОбъектыНедвижимости.КатегорияОбъекта = &Здания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбъектыНедвижимости.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ВТ_ОбъектыНедвижимости.ПараметрРаспределения КАК ПараметрРаспределения,
		|	ЕСТЬNULL(ВложенныйЗапрос.Значение, ЛОЖЬ) КАК РаспределяемыеЗатраты
		|ИЗ
		|	ВТ_ОбъектыНедвижимости КАК ВТ_ОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НаправленияДеятельностиДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|			НаправленияДеятельностиДополнительныеРеквизиты.Значение КАК Значение
		|		ИЗ
		|			Справочник.НаправленияДеятельности.ДополнительныеРеквизиты КАК НаправленияДеятельностиДополнительныеРеквизиты
		|		ГДЕ
		|			НаправленияДеятельностиДополнительныеРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УСОERP_РаспределяемыеЗатраты)) КАК ВложенныйЗапрос
		|		ПО ВТ_ОбъектыНедвижимости.НаправлениеДеятельности = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВТ_ОбъектыНедвижимости.ПараметрРаспределения, 0) = 0
		|	И ЕСТЬNULL(ВложенныйЗапрос.Значение, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(ВТ_ОбъектыНедвижимости.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбъектыНедвижимости.НаправлениеДеятельности,
		|	ВТ_ОбъектыНедвижимости.ПараметрРаспределения,
		|	ЕСТЬNULL(ВложенныйЗапрос.Значение, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетУчета", Справочники.УСОERP_ПредопределенныеЭлементы.СчетУчетаОбъектовНедвижимости.Значение);
	Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбъектыСтроительства);
	Запрос.УстановитьПараметр("Здания", Перечисления.АУН_КатегорииОбъектовНедвижимости.Здание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.БазаРаспределения.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОстаткамНаСервере();
		Модифицированность = Истина;
	Конецесли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрРаспределения(Команда)
	
	ЗаполнитьПараметрРаспределенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрРаспределенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыЭксплуатации.Ссылка КАК ОбъектЭксплуатации,
	|	ОбъектыЭксплуатации.НаправлениеДеятельности
	|ПОМЕСТИТЬ ВТ_ОбъектыЭксплуатации
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|ГДЕ
	|	НЕ ОбъектыЭксплуатации.ПометкаУдаления
	|	И ОбъектыЭксплуатации.НаправлениеДеятельности В(&НаправленияДеятельности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АУН_ОбъектыНедвижимости.Ссылка КАК ОбъектНедвижимости,
	|	ВТ_ОбъектыЭксплуатации.ОбъектЭксплуатации,
	|	ВТ_ОбъектыЭксплуатации.НаправлениеДеятельности,
	|	УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбщаяПлощадь КАК ПараметрРаспределения
	|ПОМЕСТИТЬ ВТ_ПлощадиОбъектов
	|ИЗ
	|	ВТ_ОбъектыЭксплуатации КАК ВТ_ОбъектыЭксплуатации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АУН_ОбъектыНедвижимости КАК АУН_ОбъектыНедвижимости
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(&КонецПериода, ) КАК УПН_ПлощадиОбъектовНедвижимостиСрезПоследних
	|			ПО АУН_ОбъектыНедвижимости.Ссылка = УПН_ПлощадиОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
	|		ПО ВТ_ОбъектыЭксплуатации.ОбъектЭксплуатации = АУН_ОбъектыНедвижимости.ОбъектЭксплуатации
	|ГДЕ
	|	АУН_ОбъектыНедвижимости.КатегорияОбъекта = &Здания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлощадиОбъектов.НаправлениеДеятельности,
	|	ВТ_ПлощадиОбъектов.ПараметрРаспределения
	|ИЗ
	|	ВТ_ПлощадиОбъектов КАК ВТ_ПлощадиОбъектов
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_ПлощадиОбъектов.ПараметрРаспределения, 0) = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПлощадиОбъектов.НаправлениеДеятельности,
	|	ВТ_ПлощадиОбъектов.ПараметрРаспределения";
	
	Запрос.УстановитьПараметр("НаправленияДеятельности", Объект.БазаРаспределения.Выгрузить().ВыгрузитьКолонку("НаправлениеДеятельности"));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Здания", Перечисления.АУН_КатегорииОбъектовНедвижимости.Здание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТЗ Из Объект.БазаРаспределения Цикл
		СтруктураПоиска = Новый Структура("НаправлениеДеятельности", СтрТЗ.НаправлениеДеятельности);
		МассивСтрок = Результат.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрТЗ.ПараметрРаспределения = МассивСтрок[0].ПараметрРаспределения;
		Иначе
			СтрТЗ.ПараметрРаспределения = 0;
		КонецЕсли;		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	//УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	//УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
		
КонецПроцедуры

#Область ПриИзмененииРеквизитов

#КонецОбласти

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	//УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
